"""

Деревянный меч : 10
Бронзовый меч : 20
Железный меч : 50
Стальной меч : 75

Никелированный меч : 90
Цинкированный меч : 90
Свинцированный меч : 100

Вольфрамированный меч : 150
Титанированный меч : 200
Радиоактивный меч : 250

"""


"""
{
Алюминий (Al): около 8,1% 1 | 810
Железо (Fe): около 5% 2 | 500
Титан (Ti): около 0,56% 3 | 56
Углерод (C): около 0,02% 4 | 2
Медь (Cu): около 0,01% 5 | 1
Никель (Ni): около 0,008% 6 | 0.8
Цинк (Zn): около 0,0075% 7 | 0.75
Свинец (Pb): около 0,001% 8 | 0.1
Вольфрам (W): около 0,0007% 9 | 0.07
Уран (U): около 0.0002% 10 | 0.02
} столько грамм добывается при одном заходе

Алюминий: 397
Железо: 272
Титан: 390
Медь: 210
Никель: 285
Цинк: 113
Свинец: 23
Вольфрам: 175
Уран: 13600

[397, 272, 390, 210, 285, 113, 23, 175, 13600] : дж/г металла
[75, 110, 77, 143, 105, 265, 1304, 171, 2] : грамм металла на 1 грамм угля

[8.1,5,0.56,0.02,0.01,0.008,0.0075,0.001,0.0007,0.0002] : % на 10кг
[810, 500, 56, 2, 1, 0.8, 0.75, 0.1, 0.07] : грамм металла на 10кг (1 заход, от 10 до 2 сек)
 
10kg = 10000gr
"""


"""
опушка
["Зеленая Роща", "Птичий Глаз", "Лесная Гавань", "Осенний Вздох", "Ветряная Чаща", "Ручейная Поляна", "Солнечный Пролив"
,"Дубовая Стрежень", "Лесная Зарница", "Тихий Уголок", "Рябиновый Ручей", "Златогривый Берег"]

поляна
["Ягодная Радуга", "Малиновая Поляна", "Голубичный Уголок", "Клубника Пикник", "Земляничный Рай", "Шиповниковый Коридор"
,"Клюквенный Берег", "Брусничная Роща", "Ароматный Край", "Черничная Оазис", "Морошка Крапива", "Красноягодный Угол"]

лесорубка
names = ["Бревенчатый Лагерь", "Пилорама Гроза", "Топорище", "Дровосекова Задача", "Лесная Рубка", "Секачи Призраки",
"Рубильный Край", "Сосновая Палуба", "Тигель Древесины", "Осиная Мастерская", "Расколотый Дуб", "Лесной Трофей"]

"""

s = ["Бревенчатый Лагерь", "Пилорама Гроза", "Топорище", "Дровосекова Задача", "Лесная Рубка", "Секачи Призраки",
"Рубильный Край", "Сосновая Палуба", "Тигель Древесины", "Осиная Мастерская", "Расколотый Дуб", "Лесной Трофей"]

text = ''
for i in range(12):
    text += f'[ib("{s[i]}", callback_data="logging{i+1}")],\n'

print(text)
